Autodesk.Revit.DB.Structure.PositionOnCurve
Specifies position on analytical curve to calculate direction.

Autodesk.Revit.DB.Structure.PositionOnCurve.MainPosition
Common direction from start to end points.

Autodesk.Revit.DB.Structure.PositionOnCurve.EndPointPosition
Direction in end point of analytical curve.

Autodesk.Revit.DB.Structure.PositionOnCurve.StartPointPosition
Direction in start point of analytical curve.